# 5주차 과제 보강
- 60171100 윤민혁

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic')

In [3]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [7]:
def q3cut(s):
    return pd.qcut(s, 3, labels = ['low','middle','high'])

titanic['age_class'] = titanic.age.transform(q3cut)
#titanic['age_class'] = pd.qcut(titanic.age, 3, labels = ['low','middle','high'])

In [8]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_class
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,low
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,high
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,middle
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,high
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,high
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,middle
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,low
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,middle
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,middle

In [9]:
grouped_age = titanic.groupby(['age_class'])

In [10]:
grouped_age

In [12]:
grouped_age['survived'].sum()

age_class
low       103
middle     93
high       94
Name: survived, dtype: int64

In [13]:
grouped_age['survived'].count()

age_class
low       246
middle    232
high      236
Name: survived, dtype: int64

In [14]:
grouped_age['survived'].sum() / grouped_age['survived'].count()

age_class
low       0.418699
middle    0.400862
high      0.398305
Name: survived, dtype: float64

In [15]:
grouped_sex = titanic.groupby(['sex'])

In [16]:
grouped_sex['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [19]:
grouped_class  = titanic.groupby(['pclass'])

In [20]:
grouped_class['survived'].mean()

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [21]:
d = titanic.groupby(['sex','class','age_class'])['survived'].mean()

In [22]:
d

sex     class   age_class
female  First   low          0.954545
                middle       0.947368
                high         0.977273
        Second  low          1.000000
                middle       0.909091
                high         0.857143
        Third   low          0.508475
                middle       0.481481
                high         0.250000
male    First   low          0.500000
                middle       0.500000
                high         0.347826
        Second  low          0.357143
                middle       0.076923
                high         0.062500
        Third   low          0.158879
                middle       0.195652
                high         0.055556
Name: survived, dtype: float64

In [23]:
survived_rate = titanic.groupby(['sex','class'])['survived'].mean()

In [24]:
survived_rate

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [28]:
df = pd.DataFrame({
    'survived' : list(survived_rate),
    'sex' : ['female','female','female','male','male','male'],
    'class' : ['First','Second','Third','First','Second','Third']
})

In [29]:
df

   survived     sex   class
0  0.968085  female   First
1  0.921053  female  Second
2  0.500000  female   Third
3  0.368852    male   First
4  0.157407    male  Second
5  0.135447    male   Third

In [30]:
df.pivot('sex','class','survived')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [31]:
#unstack()으로 피벗테이블 만들기
survived_rate

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [32]:
df = survived_rate.unstack()

In [33]:
df

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447